app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "user_id", "video_id") VALUES ('2011-12-03 21:15:21.816476', 1, 1)
---
  def create
    @post = Post.new(params[:post])
    if @post.save