app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY users.created_at asc
---
  def index
    @users = User.all(:order => 'users.created_at asc')

SELECT "users".* FROM "users" WHERE ("users"."username" = 'test') LIMIT 1
SELECT "posts".* FROM "posts" WHERE ("posts".user_id = 1) ORDER BY posts.created_at desc LIMIT 3 OFFSET 0
---
  def show
    @user = User.find_by_username! params[:id]
    @posts = @user.posts.get :page => params[:page], :include => :video

INSERT INTO "users" ("authentication_token", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "failed_attempts", "followers_count", "followings_count", "last_sign_in_at", "last_sign_in_ip", "locked_at", "name", "password_salt", "posts_count", "remember_created_at", "remember_token", "reset_password_token", "sign_in_count", "unlock_token", "updated_at", "username") VALUES (NULL, NULL, NULL, NULL, '2011-12-03 21:15:02.746264', NULL, NULL, 'test@example.com', '$2a$10$BLgv420bm3KjCTLFtqwHiO6lXPDs3krocyY8u5bALMO0cgC71bc1i', 0, 0, 0, NULL, NULL, NULL, 'test', '$2a$10$BLgv420bm3KjCTLFtqwHiO', 0, NULL, NULL, NULL, 0, NULL, '2011-12-03 21:15:02.746264', 'test')
---
  def create
    @user = User.new params[:user]
    if @user.save

SELECT "users".* FROM "users" WHERE ("users"."username" = 'test') LIMIT 1
SELECT "feed_items".* FROM "feed_items" WHERE ("feed_items".user_id = 1) ORDER BY feed_items.post_created_at desc LIMIT 3 OFFSET 0
---
  def feed
    @user = User.find_by_username! params[:user_id]
    @feed_items = @user.feed_items.get :page => params[:page]