app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" ORDER BY videos.created_at desc LIMIT 3 OFFSET 0
---
  def index
    @videos = Video.order("created_at desc").includes(:first_person).page(params[:page]).per_page(Video::PER_PAGE)